# From tensorflow/models/research:
# python object_detection/train.py --logtostderr --pipeline_config_path=/home/YumingWu/Project/butterfly/models/model/faster_rcnn_resnet101.config --train_dir=/home/YumingWu/Project/butterfly/models/model/train
# python object_detection/eval.py --logtostderr --pipeline_config_path=/home/YumingWu/Project/butterfly/models/model/faster_rcnn_resnet101.config --eval_dir=/home/YumingWu/Project/butterfly/models/model/eval --checkpoint_dir=/home/YumingWu/Project/butterfly/models/model/train
# python object_detection/eval.py --logtostderr --pipeline_config_path=/home/YumingWu/Project/butterfly/models/model/faster_rcnn_resnet101.config --eval_dir=/home/YumingWu/Project/butterfly/models/model/test --checkpoint_dir=/home/YumingWu/Project/butterfly/models/model/train

model {
  faster_rcnn {
    num_classes: 108
    image_resizer {
      keep_aspect_ratio_resizer {
        min_dimension: 800
        max_dimension: 1600
      }
    }
    feature_extractor {
      type: 'faster_rcnn_resnet101'
      first_stage_features_stride: 16
#      batch_norm_trainable: true
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
#    first_stage_atrous_rate: 3
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 32
    first_stage_localization_loss_weight: 1.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 14
    maxpool_kernel_size: 2
    maxpool_stride: 2
    second_stage_batch_size: 32
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 3
        max_total_detections: 5
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 1.0
    second_stage_classification_loss_weight: 2.0
  }
}

train_config: {
  batch_size: 1
  optimizer {
    momentum_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 0.0003
          schedule {
            step: 0
            learning_rate: .0003
          }
          schedule {
            step: 10000
            learning_rate: .00003
          }
          schedule {
            step: 100000
            learning_rate: .000003
          }

        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: true
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "/home/YumingWu/Project/butterfly/models/pre-trained/mine_inception_v2/model.ckpt-200000"
  from_detection_checkpoint: true
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
  num_steps: 200000
  data_augmentation_options {
    normalize_image{
      original_minval: 0.0
      original_maxval: 255.0
    }
    random_pixel_value_scale{}
    random_horizontal_flip{}
    random_vertical_flip{}
    random_rotation90{}
    random_adjust_brightness{}
    random_adjust_contrast{}
    random_adjust_hue{}
    random_adjust_saturation{}
    random_pad_image{
      max_image_height: 2000
      max_image_width: 3000
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/home/YumingWu/Project/butterfly/experiment/dataButterflyKuo2/butterfly_kuo2.record"
#		 "/home/YumingWu/Project/butterfly/data/train/butterfly_2.record"]
  }
#  label_map_path: "/home/YumingWu/Project/butterfly/experiment/dataButterflyKuo2/butterfly_kuo_label_map1.pbtxt"
  shuffle: false
}

eval_config: {
  num_examples: 415
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
#  max_evals: 2
  visualize_groundtruth_boxes: true
  eval_interval_secs: 1800
  metrics_set: 'butterfly_metrics'
  groundtruth_box_visualization_color: 'white'
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/home/YumingWu/Project/butterfly/data/tf_records/butterfly_clean_test.record"
  }
  label_map_path: "/home/YumingWu/Project/butterfly/data/butterfly_save/butterfly_kuo_label_map.pbtxt"
  shuffle: false
  num_readers: 1
}
